# RebarShapeConstraint180DegreeDefaultBend Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraint180DegreeDefaultBend Constructor
RebarShapeConstraint180DegreeDefaultBend Class See Also
---
Create a 180-degree bend constraint.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarShapeConstraint180DegreeDefaultBend()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
RebarShapeConstraint180DegreeDefaultBend()
```

# See Also
RebarShapeConstraint180DegreeDefaultBend Class
Autodesk.Revit.DB.Structure Namespace